using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class ActionConstructor : MonoBehaviour
{
    /*Тело--
     Название
    описание
    Стоимость
    Стоимость очков действий
    Доп стоймость за последующие очки навыка
     
    уровень доступа - разработчик, игрок:
    *МакроДействие++
     */

    /*МакроДействие--
    Время в которое работает способность - Стрельба, бой, оба
    класс действия - Начало хода, конец хода, перед атакой, после атаки, при установке карты, при возвращении карты в руку, при смерти карты
     УсловиеДейстивия++
     */

    /*УсловиеДейстивия--
     * охват
     условие - меньше, равно, больше
     
     */

    /*Действие--
     * на кого действует - все, враги, друзья
     Область действия - цель, я, все
     Накладываемый эффект
     */
    // Start is called before the first frame update
    void Start()
    {
        
    }

    // Update is called once per frame
    void Update()
    {
        
    }
}
